The tread depth is too large for the spiral run.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TreadDepthTooBigFailure { get; }
  Visual Basic
Public Shared ReadOnly Property TreadDepthTooBigFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TreadDepthTooBigFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace